Revit 2026 API

# BuiltInFailuresSpanDirectionSymbolFailures Class

---

Failures about SpanDirectionSymbol.

SystemObject Autodesk.Revit.DBBuiltInFailuresSpanDirectionSymbolFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SpanDirectionSymbolFailures
```
```vb
Public NotInheritable Class SpanDirectionSymbolFailures
```
```cpp
public ref class SpanDirectionSymbolFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SpanDirectionSymbolFailures = class end
```

The BuiltInFailuresSpanDirectionSymbolFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NonPlanView | Span Direction Symbol can only be placed in a Floor Plan View. |

#### Reference

Autodesk.Revit.DB Namespace